test/non-functional/gatling/src/test/resources/bodies/SendSimpleIndexRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nat="http://nationellpatientoversikt.se">
   <soapenv:Header/>
   <soapenv:Body>
      <nat:SendSimpleIndex>
         <!--Optional:-->
         <nat:subject_of_care_id>191212121212</nat:subject_of_care_id>
         <!--Optional:-->
         <nat:info_types>
            <!--Zero or more repetitions:-->
            <nat:info_type info_type_id="vko" exists="true"/>
         </nat:info_types>
         <!--Optional:-->
         <nat:parameters>
            <!--Zero or more repetitions:-->
            <nat:parameter>
               <!--Optional:-->
               <nat:name>hsa_id</nat:name>
               <!--Optional:-->
               <nat:value>VS-1</nat:value>
            </nat:parameter>
            <nat:parameter>
               <nat:name>transaction_id</nat:name>
               <nat:value>TX-1234</nat:value>
            </nat:parameter>
            <nat:parameter>
               <!--Optional:-->
               <nat:name>version</nat:name>
               <!--Optional:-->
               <nat:value>1.1</nat:value>
            </nat:parameter>
         </nat:parameters>
      </nat:SendSimpleIndex>
   </soapenv:Body>
</soapenv:Envelope>